config.org
#+title: Steven's Emacs configuration
#+author: Steven Folkersma
#+language: en
#+STARTUP: content noflyspell

* Steven's Emacs literal emacs configuration 

This file describes my emacs configuration. 

#+begin_src emacs-lisp
(org-babel-tangle)
#+end_src

#+RESULTS:
| /Users/stevenfolkersma/.config/emacs/init.el |

* The pre initialization of emacs (=early-init.el=)

** The =early-init.el= initialises the package cache

I use the standard =package.el= to manage my Emacs packages [[* The =init.el= section to set up the package manager][The =init.el= section to set up the package manager]]. It works for me and I never had a need for more. If I have to tinker with a package's source code, I use Git ordinarily---no need for a package manager to also be a development tool.

#+begin_src emacs-lisp :tangle "early-init.el"
;; Initialise installed packages at this early stage, by using the
;; available cache.  I had tried a setup with this set to nil in the
;; early-init.el, but (i) it ended up being slower and (ii) various
;; package commands, like `describe-package', did not have an index of
;; packages to work with, requiring a `package-refresh-contents'.
(setq package-enable-at-startup t)
#+end_src


** The =early-init.el= tweaks to startup time and garbage collection

I do not have a deep understanding of "garbage collection", though I
have learnt through trial and error that I can maximise the threshold
during startup to make Emacs boot a bit faster. What I am doing here
is to arrange for the relevant values to be set to very high values
during startup and then be brought down to something more practical
once Emacs is done loading.

#+begin_src emacs-lisp :tangle "early-init.el"
;; Temporarily increase the garbage collection threshold.  These
;; changes help shave off about half a second of startup time.  The
;; `most-positive-fixnum' is DANGEROUS AS A PERMANENT VALUE.  See the
;; `emacs-startup-hook' a few lines below for what I actually use.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

;; Same idea as above for the `file-name-handler-alist' and the
;; `vc-handled-backends' with regard to startup speed optimisation.
;; Here I am storing the default value with the intent of restoring it
;; via the `emacs-startup-hook'.
(defvar steven-emacs--file-name-handler-alist file-name-handler-alist)
(defvar steven-emacs--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 100 100 8)
                  gc-cons-percentage 0.1
                  file-name-handler-alist steven-emacs--file-name-handler-alist
                  vc-handled-backends steven-emacs--vc-handled-backends)))
#+end_src

** The =early-init.el= names the default frame

Naming frames allows you to select them using completion. Emacs can do this (=M-x select-frame-by-name=), though it is not always reliable as it depends on the window manager (it works fine on GNOME, from what I can tell). For minimalist window managers on Linux, something like the ~rofi~ program can select system windows based on their name.

#+begin_src emacs-lisp :tangle "early-init.el"
(add-hook 'after-init-hook (lambda () (set-frame-name "home")))
#+end_src


* The main initialization of emacs (=init.el=)

** The =init.el= section to set up the package manager

The =package.el= is built into Emacs. We do not need to load it explicitly, as it will be called
by ~use-package~ when it needs it (also Prot's video about
[[https://protesilaos.com/codelog/2024-07-23-emacs-use-package-essentials/][~use-package~ essentials]] (2024-07-23)). Since the introduction of the
=early-init.el= file, we also do not need to initialise the packages
at this point: we activate the cache instead.

With regard to the settings here, make sure to read my article about
package archives, pinning packages, and setting priorities:
<https://protesilaos.com/codelog/2022-05-13-emacs-elpa-devel/>.

#+begin_src emacs-lisp :tangle "init.el"
;; Also read: <https://protesilaos.com/codelog/2022-05-13-emacs-elpa-devel/>
(setq package-archives
      '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
        ("nongnu" . "https://elpa.nongnu.org/nongnu/")
        ("melpa" . "https://melpa.org/packages/")))

;; Highest number gets priority (what is not mentioned has priority 0)
(setq package-archive-priorities
      '(("gnu-elpa" . 3)
        ("melpa" . 2)
        ("nongnu" . 1)))

(add-to-list 'display-buffer-alist
             '("\\`\\*\\(Warnings\\|Compile-Log\\)\\*\\'"
               (display-buffer-no-window)
               (allow-no-window . t)))
#+end_src

#+RESULTS:
| \`\*Calendar\*\' | (display-buffer-below-selected) |                            |                       |
| \`\*\(Warnings\  | Compile-Log\)\*\'               | (display-buffer-no-window) | (allow-no-window . t) |


** The =init.el= section to set folder with custom .el files
#+begin_src emacs-lisp :tangle "init.el" :results silent
(add-to-list 'load-path "~/.config/emacs/steven")
#+end_src

** The =init.el= section to stop emacs from saving backup files
By default, Emacs tries to lock down files so that they are not
modified by other programs. It also keeps backups.
*Note*: I am not sure it removing lockfiles is smart, since I edit the files on mulitple machines.

#+begin_src emacs-lisp :tangle "init.el"
  (setq make-backup-files nil)
  (setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
  (setq create-lockfiles nil)
#+end_src

#+RESULTS:


** The =init.el= section to set the custom user file
By default, Emacs writes persistent customisations to the end of the user's init file. These are encapsulated in a "custom" block. Emacs writes those whenever the user does something with =M-x customize= or related.

I personally prefer writing the actual Elisp over using the interface of =M-x customize=. I also want my init file to only ever contain what I wrote and to never---ever!---evaluate code I have not called myself.

As such, I want to set the ~custom-file~ variable to tell Emacs to write its persistent variables to that file instead of my =init.el=.
Though since I have no intent to ever use this file, I choose to make it disposable by placing it inside of the =/tmp= directory (this is what the ~make-temp-file~ function does). So when I close the computer, the file is gone. Finally, I do not invoke the ~load~
function because I will never rely on the ~custom-file~. 

#+begin_src emacs-lisp :tangle "init.el"
  ;; Disable the damn thing by making it disposable.
  (setq custom-file (make-temp-file "emacs-custom-"))
  (load custom-file :no-error-if-file-is-missing)
#+end_src

#+RESULTS:
: t


** The =init.el= setup of the startup screen
#+begin_src emacs-lisp :tangle "init.el"
  (setq initial-buffer-choice t)
  (setq initial-major-mode 'emacs-lisp-mode)
  (setq-default inhibit-startup-screen t)
  (setq inhibit-splash-screen t)
  (setq inhibit-startup-message t) 
  (setq initial-scratch-message
  ""      
  )
#+end_src

#+RESULTS:

#+end_src

** The =init.el= section to add basic keybindings
Quality of life snipper from Prot's setup.
#+begin_src emacs-lisp :tangle "init.el"
(defun steven/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(define-key global-map (kbd "C-g") #'steven/keyboard-quit-dwim)
#+end_src

#+RESULTS:
: steven/keyboard-quit-dwim

Some settings from the NANO config (I use prot's code for modifying C-g, which is normally also included in NANO emacs)

#+begin_src emacs-lisp :tangle "init.el"
(defun nano-kill ()
  "Delete frame or kill emacs if there is only one frame left"

  (interactive)
  (condition-case nil
      (delete-frame)
    (error (save-buffers-kill-terminal))))

(bind-key "C-x k" #'kill-current-buffer)
(bind-key "C-x C-c" #'nano-kill)
(bind-key "C-x C-r" #'recentf-open)
(bind-key "M-n" #'make-frame)
(bind-key "C-z"  nil) ;; No suspend frame
(bind-key "C-<wheel-up>" nil) ;; No text resize via mouse scroll
(bind-key "C-<wheel-down>" nil) ;; No text resize via mouse scroll
#+end_src

#+begin_src emacs-lisp :tangle "init.el"
(global-set-key "\C-x\C-m" 'execute-extended-command)

(global-set-key "\C-c\C-m" 'execute-extended-command)

(global-set-key "\C-w" 'backward-kill-word)

(global-set-key "\C-c\C-k" 'kill-region)

(global-unset-key (kbd "C-x m"))

#+end_src

#+RESULTS:

** The =init.el= section with basic sane settings

Those three belong in the early-init.el, but I am putting them here
for convenience.  If the early-init.el exists in the same directory
as the init.el, then Emacs will read+evaluate it before moving to
the init.el.

#+begin_src emacs-lisp :tangle "init.el"
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(blink-cursor-mode -1)
(global-hl-line-mode 1)
(pixel-scroll-precision-mode 1)
(set-default-coding-systems 'utf-8)
(setq-default indent-tabs-mode nil
              ring-bell-function 'ignore
              select-enable-clipboard t)  
#+end_src

#+RESULTS:
: t

