init.el

(defun steven/setup-fonts-linux ()
  (let ((mono-spaced-font "Roboto Mono")
        (proportionately-spaced-font "DejaVu Sans"))
    (set-face-attribute 'default nil :family mono-spaced-font :weight 'normal :height 180)
    (set-face-attribute 'fixed-pitch nil :family mono-spaced-font :height 1.0)
    (set-face-attribute 'variable-pitch nil :weight 'normal :family proportionately-spaced-font :height 1.1)))

(defun steven/setup-fonts-mac ()
  (let ((mono-spaced-font "Roboto Mono")
        (proportionately-spaced-font "DejaVu Sans"))
    (set-face-attribute 'default nil :family mono-spaced-font :weight 'thin :height 170)
    (set-face-attribute 'fixed-pitch nil :family mono-spaced-font :height 1.0)
    (set-face-attribute 'variable-pitch nil :weight 'normal :family proportionately-spaced-font :height 1.1)))

;; Run after Emacs initializes and after any theme is applied
(if (eq system-type 'darwin)
    ;; macOS-specific configuration
   (progn
    (add-hook 'after-init-hook #'steven/setup-fonts-mac)
    (add-hook 'after-load-theme-hook #'steven/setup-fonts-mac))
  ;; Non-macOS configuration
  (progn
   (add-hook 'after-init-hook #'steven/setup-fonts-linux)
   (add-hook 'after-load-theme-hook #'steven/setup-fonts-linux)))

(set-display-table-slot standard-display-table 'truncation (make-glyph-code ?…))
(set-display-table-slot standard-display-table 'wrap (make-glyph-code ?–))

(defun nano-theme-set-light ()
  "Apply light Nano theme base."
  ;; Colors from Material design at https://material.io/
  (setq frame-background-mode    'light)
  (setq nano-color-foreground "#37474F") ;; Blue Grey / L800
  (setq nano-color-background "#FFFFFF") ;; White
  (setq nano-color-highlight  "#ECEFF1") ;; Very Light Grey
  (setq nano-color-critical   "#FF6F00") ;; Amber / L900
  (setq nano-color-salient    "#673AB7") ;; Deep Purple / L500
  (setq nano-color-strong     "#000000") ;; Black
  (setq nano-color-popout     "#FFAB91") ;; Deep Orange / L200
  (setq nano-color-subtle     "#ECEFF1") ;; Blue Grey / L50
  (setq nano-color-faded      "#B0BEC5") ;; Blue Grey / L200
  ;; to allow for toggling of the themes.
  (setq nano-theme-var "light")
  )

(defun nano-theme-set-dark ()
  "Apply dark Nano theme base."
  ;; Colors from Nord theme at https://www.nordtheme.com
  (setq frame-background-mode     'dark)
  (setq nano-color-foreground "#ECEFF4") ;; Snow Storm 3  / nord  6
  (setq nano-color-background "#2E3440") ;; Polar Night 0 / nord  0
  (setq nano-color-highlight  "#3B4252") ;; Polar Night 1 / nord  1
  (setq nano-color-critical   "#EBCB8B") ;; Aurora        / nord 11
  (setq nano-color-salient    "#81A1C1") ;; Frost         / nord  9
  (setq nano-color-strong     "#ECEFF4") ;; Snow Storm 3  / nord  6
  (setq nano-color-popout     "#D08770") ;; Aurora        / nord 12
  (setq nano-color-subtle     "#434C5E") ;; Polar Night 2 / nord  2
  (setq nano-color-faded      "#677691") ;;
  ;; to allow for toggling of the themes.
  (setq nano-theme-var "dark")
  )

(require 'nano-base-colors)
  (require 'nano-faces)
  (require 'nano-modeline)
  (require 'nano-theme)
;  (require 'nano-theme-dark)
;  (require 'nano-theme-light)

  (cond                                                       
   ((member "-default" command-line-args) t)                  
   ((member "-dark" command-line-args) (nano-theme-set-dark)) 
   (t (nano-theme-set-light)))                                
  (call-interactively 'nano-refresh-theme)

(use-package nerd-icons
  :ensure t)

(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-corfu
  :ensure t
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))

(setq display-line-numbers-type t)
;;(fringe-mode 1)
(setq default-frame-alist
   '((width  . 72) (left-fringe . 0) (right-fringe . 0)
    (internal-border-width . 32) (vertical-scroll-bars . nil)
    (bottom-divider-width . 0) (right-divider-width . 32)
    (undecorated-round . t)))
(modify-frame-parameters nil default-frame-alist)
(setq-default pop-up-windows nil)

;; different setting for GNOME

(if (eq system-type 'darwin)
    ;; macOS-specific configuration
    (set-frame-parameter nil 'undecorated-round t)
  ;; Non-macOS configuration
  (set-frame-parameter nil 'undecorated nil))

(setq-default fill-column 80)
;;(global-visual-line-mode 1)
;; set visual-line-mode only with text
(add-hook 'text-mode-hook 'visual-line-mode) 
(add-hook 'text-mode-hook 'visual-wrap-prefix-mode)

(defun center-frame ()
  "Center the current frame on the display."
  (let* ((frame (selected-frame))
         (frame-w (frame-pixel-width frame))
         (frame-h (frame-pixel-height frame))
         (display-w (display-pixel-width))
         (display-h (display-pixel-height))
         (pos-x (/ (- display-w frame-w) 2))
         (pos-y (/ (- display-h frame-h) 2)))
    (set-frame-position frame (max pos-x 0) (max pos-y 0))))

;; Hook into startup
(add-hook 'window-setup-hook #'center-frame)

(defun steven/toggle-frame-width ()
  "Toggle the frame width between narrow and wide, and adjust height to fit display."
  (interactive)
  (let* ((frame (selected-frame))
         (current-width (frame-width frame))
         (narrow-width 72)
         (wide-width 135)
         (char-height (frame-char-height frame))
         (display-height (display-pixel-height))
         (usable-height (- display-height 40)) 
         (frame-rows (/ usable-height char-height)))
    (set-frame-height frame frame-rows)
    (set-frame-width frame (if (> current-width narrow-width)
                               narrow-width
                             wide-width)))
    (center-frame))

(global-set-key (kbd "C-c t w") 'steven/toggle-frame-width)

(use-package delsel
  :ensure nil
  :hook (after-init . delete-selection-mode))

(use-package trashed
  :ensure t
  :commands (trashed)
  :config
  (setq trashed-action-confirmer 'y-or-n-p)
  (setq trashed-use-header-line t)
  (setq trashed-sort-key '("Date deleted" . t))
  (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))

(use-package dired
    :ensure nil
    :commands (dired)
    :hook
