config.org
** The =init.el= setup of dired

- I turn on hide details because I dont need info on permission etc., it can be toggled when needed.
- hl-line-mode: this makes the current line always highlighted
- By default the icons are shown, which is setup in [[*Theme and nerd icons setup][Theme and nerd icons setup]]

#+begin_src emacs-lisp :tangle "init.el"
  (use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode)
     (dired-mode . dired-omit-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t)
    (setq dired-listing-switches "-alh --group-directories-first")
    (use-package dired-x
       :ensure nil  ;; also built-in
       :config
       (setq dired-omit-files
            (concat dired-omit-files
             "\\|^\\.DS_Store$"
             "\\|^\\.stfolder$"
             "\\|^\\.localized$"))))

(defun steven/dired-layout ()
  "Custom behaviors for dired layout."
  ;;truncate-lines is buffer local, so can be safely changed
  (setq truncate-lines t))

;; The above does not work because the 'hide details
;; mode' is also hooked to dired mode and overrides my
;; settings. Check C-h v dired-mode-hook.

;; The following appends it to the hook list at the end
(add-hook 'dired-mode-hook
          #'steven/dired-layout
          t)


#+end_src

#+RESULTS:
| denote-dired-mode | dired-extra-startup | dired-omit-mode | hl-line-mode | dired-hide-details-mode | nerd-icons-dired-mode | #[nil ((setq truncate-lines t)) nil] | steven/dired-layour | steven/dired-layout |

** The =init.el= section on dired-subtree
Dired subtree is to show subtrees of folder with TAB
#+begin_src emacs-lisp :tangle "init.el"
(use-package dired-subtree
  :ensure t
  :after dired
  :bind
  ( :map dired-mode-map
    ("<tab>" . dired-subtree-toggle)
    ("TAB" . dired-subtree-toggle)
    ("<backtab>" . dired-subtree-remove)
    ("S-TAB" . dired-subtree-remove))
  :config
  (setq dired-subtree-use-backgrounds nil))
#+end_src

** The =init.el= section on dired-preview
#+begin_src emacs-lisp :tangle "init.el"
(use-package dired-preview
    :ensure t
    :config
    (setq dired-preview-delay 0.7)
    (setq dired-preview-max-size (expt 2 20))
    (setq dired-preview-ignored-extensions-regexp
          (concat "\\."
                  "\\(gz\\|"
                  "zst\\|"
                  "tar\\|"
                  "xz\\|"
                  "rar\\|"
                  "zip\\|"
                  "iso\\|"
                  "epub"
                  "\\)")))

#+end_src


** The =init.el= section to setup colorful mode

#+begin_src emacs-lisp :tangle "init.el"
(use-package colorful-mode
  ;; :diminish
  :ensure t ; Optional
  :custom
  (colorful-use-prefix t)
  (colorful-prefix-string " ")
  (colorful-only-strings 'only-prog)
  (css-fontify-colors nil)
  :config
  (global-colorful-mode t)
  (add-to-list 'global-colorful-modes 'helpful-mode))

#+end_src

#+RESULTS:
: t

** The =init.el= setup of the dictionary

- The gcide dictionary specifically pulls from Webster's 1913 content. If you omit the dictionary-default-dictionary setting, you'll get results from all available dictionaries on dict.org (including Webster's).

- Interactive search: Run M-x dictionary-search RET (or your custom keybinding like C-c d), enter a word (e.g., "serendipity"), and press Enter. Results appear in a new buffer with definitions, etymology, and hyperlinks for related words.
- Lookup word at point: Position your cursor on a word and run M-x dictionary-lookup-definition. This queries the default dictionary (GCIDE/Webster's).
- Match/regex search: Use M-x dictionary-match for partial matches (e.g., "seren*").

The results buffer supports navigation: hyperlinks (e.g., for synonyms or related terms) are clickable, and you can browse history with dictionary-previous/dictionary-next.

#+begin_src emacs-lisp :tangle "init.el"
;; Set the default server to dict.org (avoids prompting each time)
(setq dictionary-server "dict.org")

;; Optional: Set default dictionary to GCIDE for Webster's 1913
(setq dictionary-default-dictionary "gcide")

;; Optional: Bind a key for quick lookups (e.g., on the current word at point)
(global-set-key (kbd "C-c d") #'dictionary-search)


#+end_src

#+RESULTS:
: steven-flyspell-dict-indicator

** The =init.el= section to setup spell-checking

For spell checking I use hunspell, both for Linux (dnf) and macOS (brew). Dutch and English spelling libraries need to be added. Current dictionaries available by hunspell are listed with the following command:

#+begin_src bash
hunspell -D
#+end_src

My emacs functions expect *nl_NL* and *en_GB* libraries to be installed.

- nl_NL dictionaries from opentaal.nl: [[https://github.com/OpenTaal/opentaal-hunspell][GitHub - OpenTaal/opentaal-hunspell]]
- en_GB dictionaries: [[https://github.com/marcoagpinto/aoo-mozilla-en-dict][GitHub - marcoagpinto/aoo-mozilla-en-dict: English Dictionaries Project]]

Dictionary files should be placed in: 
- *Linux*: /usr/share/hunspell. 
- *macOS*: ~/Library/Spelling. 

Important command: C-; to autocorrect previous word before point. Middle click to correct a marked word. M-$ to open context menu for word on point. I have turned off the automatic hook to text mode, such that I can activate it myself.

*IMPORTANT* Underlines for correct/double words are set in nano-faces / nano-theme! 

#+begin_src emacs-lisp :tangle "init.el"
;; Use Hunspell as the spell-checker
(when (executable-find "hunspell")
  (setq-default ispell-program-name "hunspell")
  (setq ispell-really-hunspell t))

;; Default to Dutch
(setq ispell-dictionary "nl_NL")
(setq flyspell-default-dictionary "nl_NL")

;; Tell Emacs where to find the dictionaries (optional if auto-detected)
(setq ispell-local-dictionary-alist
      '(("en_GB" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_GB") nil utf-8)
        ("nl_NL" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "nl_NL") nil utf-8)))

;(add-hook 'text-mode-hook 'flyspell-mode)

(defun steven/toggle-spell-language ()
  "Toggle between English and Dutch Hunspell dictionaries."
  (interactive)
  (let ((current-dict ispell-current-dictionary))
    (cond
     ((string= current-dict "en_GB")
      (ispell-change-dictionary "nl_NL")
      (message "Switched dictionary to Dutch (nl_NL)"))
     ((string= current-dict "nl_NL")
      (ispell-change-dictionary "en_GB")
      (message "Switched dictionary to English (en_GB)"))
     (t
      (ispell-change-dictionary "en_GB")
      (message "Defaulted dictionary to English (en_GB)"))))
     (flyspell-buffer))

#+end_src

#+RESULTS:
: steven/toggle-spell-language

** The =init.el= section to add an org statup hook for spell dictionary

This creates a hook to text mode and can set the following startup to org files:
- spell NL
- spell EN
- noflyspell
It seems to work but I need to understand it better.

#+begin_src emacs-lisp
(defun steven/apply-flyspell-from-startup ()
  "Check for a #+STARTUP: line to configure flyspell in text/org modes."
  (save-excursion
    (goto-char (point-min))
    (when (re-search-forward "^#\\+STARTUP:[ \t]+\\(.*\\)$" nil t)
      (let ((args (split-string (match-string 1) "[ \t]+" t)))
        (cond
         ;; Disable flyspell
         ((member "noflyspell" args)
          (flyspell-mode -1)
          (message "Flyspell disabled by #+STARTUP directive."))

         ;; Set dictionary explicitly, e.g. #+STARTUP: spell en_GB
         ((and (member "spell" args)
               (> (length args) 1))
          (let ((dict (nth 1 args)))
            (when (flyspell-mode 1)
              (ispell-change-dictionary dict)
              (message "Flyspell dictionary set to %s by #+STARTUP directive." dict))))

         ;; Enable flyspell normally if just “spell”
         ((member "spell" args)
          (flyspell-mode 1)
          (message "Flyspell enabled by #+STARTUP directive."))))
          (nano-modeline-update-windows))))


(add-hook 'text-mode-hook
          (lambda ()
            (steven/apply-flyspell-from-startup)))

#+end_src

** The =init.el= section on 'electric' behaviour

Emacs describes as "electric" any behaviour that tries to be smart
about how to handle a given action. The ~electric-pair-mode~, for
example, automatically inserts a closing parenthesis when the user
inputs an opening parenthesis. Same idea with quotes, performed by the
~electric-quote-mode~. While the ~electric-indent-mode~ tries to be
smart about how to indent a line, which is fine for programming
purposes, it makes a mess of things in Org and related because you
have to delete back to the beginning of a line if you want to "escape"
from the indentation of a list or something.

If I need to manually wrap the symbol at point or a region in a pair
of characters, I use my ~prot-pair-insert~ command ([[#h:48d2bab5-241f-49dd-9554-8a4dcedce75e][The =prot-emacs-essentials.el= section about =prot-pair.el= (insert character pairs)]]).

#+begin_src emacs-lisp :tangle "init.el"

  ;; Enable electric-indent-mode globally
  (electric-indent-mode -1)
  (electric-pair-mode -1)
  (electric-quote-mode -1)
  
#+end_src

** The =init.el= setup of completion with vertico
Configure the minibuffer and completions.
- vertico-cycle: So I can go from bottom item to top item by down arrow or C-n
- vertico-resize nil: always keep the same size
#+begin_src emacs-lisp :tangle "init.el"
  (use-package vertico
    :ensure t
    :config
    (setq vertico-cycle t)
    (setq vertico-resize  nil)
    :hook (after-init . vertico-mode))
#+end_src

Annotate completion candidates with richer information
#+begin_src emacs-lisp :tangle "init.el"
(use-package marginalia
  :ensure t
  :hook (after-init . marginalia-mode))
#+end_src

Basically sets up fuzzy find, order of words does not matter. 
#+begin_src emacs-lisp :tangle "init.el"
(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic))
  (setq completion-category-defaults nil)
  (setq completion-category-overrides nil))
#+end_src


