init.el
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode)
     (dired-mode . dired-omit-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t)
    (setq dired-listing-switches "-alh --group-directories-first")
    (use-package dired-x
       :ensure nil  ;; also built-in
       :config
       (setq dired-omit-files
            (concat dired-omit-files
             "\\|^\\.DS_Store$"
             "\\|^\\.stfolder$"
             "\\|^\\.localized$"))))

(defun steven/dired-layout ()
  "Custom behaviors for dired layout."
  ;;truncate-lines is buffer local, so can be safely changed
  (setq truncate-lines t))

;; The above does not work because the 'hide details
;; mode' is also hooked to dired mode and overrides my
;; settings. Check C-h v dired-mode-hook.

;; The following appends it to the hook list at the end
(add-hook 'dired-mode-hook
          #'steven/dired-layout
          t)

(use-package dired-subtree
  :ensure t
  :after dired
  :bind
  ( :map dired-mode-map
    ("<tab>" . dired-subtree-toggle)
    ("TAB" . dired-subtree-toggle)
    ("<backtab>" . dired-subtree-remove)
    ("S-TAB" . dired-subtree-remove))
  :config
  (setq dired-subtree-use-backgrounds nil))

(use-package dired-preview
    :ensure t
    :config
    (setq dired-preview-delay 0.7)
    (setq dired-preview-max-size (expt 2 20))
    (setq dired-preview-ignored-extensions-regexp
          (concat "\\."
                  "\\(gz\\|"
                  "zst\\|"
                  "tar\\|"
                  "xz\\|"
                  "rar\\|"
                  "zip\\|"
                  "iso\\|"
                  "epub"
                  "\\)")))

(use-package colorful-mode
  ;; :diminish
  :ensure t ; Optional
  :custom
  (colorful-use-prefix t)
  (colorful-prefix-string " ")
  (colorful-only-strings 'only-prog)
  (css-fontify-colors nil)
  :config
  (global-colorful-mode t)
  (add-to-list 'global-colorful-modes 'helpful-mode))

;; Set the default server to dict.org (avoids prompting each time)
(setq dictionary-server "dict.org")

;; Optional: Set default dictionary to GCIDE for Webster's 1913
(setq dictionary-default-dictionary "gcide")

;; Optional: Bind a key for quick lookups (e.g., on the current word at point)
(global-set-key (kbd "C-c d") #'dictionary-search)

;; Use Hunspell as the spell-checker
(when (executable-find "hunspell")
  (setq-default ispell-program-name "hunspell")
  (setq ispell-really-hunspell t))

;; Default to Dutch
(setq ispell-dictionary "nl_NL")
(setq flyspell-default-dictionary "nl_NL")

;; Tell Emacs where to find the dictionaries (optional if auto-detected)
(setq ispell-local-dictionary-alist
      '(("en_GB" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_GB") nil utf-8)
        ("nl_NL" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "nl_NL") nil utf-8)))

;(add-hook 'text-mode-hook 'flyspell-mode)

(defun steven/toggle-spell-language ()
  "Toggle between English and Dutch Hunspell dictionaries."
  (interactive)
  (let ((current-dict ispell-current-dictionary))
    (cond
     ((string= current-dict "en_GB")
      (ispell-change-dictionary "nl_NL")
      (message "Switched dictionary to Dutch (nl_NL)"))
     ((string= current-dict "nl_NL")
      (ispell-change-dictionary "en_GB")
      (message "Switched dictionary to English (en_GB)"))
     (t
      (ispell-change-dictionary "en_GB")
      (message "Defaulted dictionary to English (en_GB)"))))
     (flyspell-buffer))

;; Enable electric-indent-mode globally
(electric-indent-mode -1)
(electric-pair-mode -1)
(electric-quote-mode -1)

(use-package vertico
  :ensure t
  :config
  (setq vertico-cycle t)
  (setq vertico-resize  nil)
  :hook (after-init . vertico-mode))

(use-package marginalia
  :ensure t
  :hook (after-init . marginalia-mode))

(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic))
  (setq completion-category-defaults nil)
  (setq completion-category-overrides nil))

(use-package consult
  :ensure t
