config.org
** The =init.el= setup of search with consult
Essential package for searching etc.
From Prot's config: The `consult' package provides lots of commands that are enhanced
variants of basic, built-in functionality.  One of the headline features of `consult' is its preview facility, where it shows in another Emacs window the context of what is currently matched in the minibuffer.
*Note Steven*: I wanted to do keybinding with C-f, but this is forward word in emacs! Current mnemonic for their prefix is "alternative search" (as opposed to the basic C-s or C-r keys).
#+BEGIN_SRC emacs-lisp :tangle "init.el"
(use-package consult
  :ensure t
  :bind (;; A recursive grep
         ("M-s M-g" . consult-grep)
         ;; Search for files names recursively
         ("M-s M-f" . consult-find)
         ;; Search through the outline (headings) of the file
         ("M-s M-o" . consult-outline)
         ;; Search the current buffer
         ("M-s M-l" . consult-line)
         ;; Switch to another buffer, or bookmarked file, or recently
         ;; opened file.
         ("C-x C-b" . consult-buffer))
   :config
   (setq consult-buffer-sources
      '(consult--source-hidden-buffer
        consult--source-buffer
        consult--source-bookmark
        ;; consult--source-recent-file   ; ← disable recent files
        ))
   (setq consult-preview-key 'any)
   (consult-customize consult-find 
                   :state (consult--file-preview))
   (consult-customize consult-fd 
                   :state (consult--file-preview))) ;; Preview every candidate as you move)
#+END_SRC

#+RESULTS:
: consult-buffer

** The =init.el= section on consult-notes

#+begin_src emacs-lisp :tangle "init.el"
(use-package consult-notes
  :ensure t
  :commands (consult-notes
             consult-notes-search-in-all-notes)
  :config
  (setq consult-notes-file-dir-sources '(("Huiswiki" ?h "~/Documents/Huiswiki/")
                                         ("Systemwiki" ?s "~/Documents/Systemwiki")))
  (setq consult-notes-org-headings-files '("~/Documents/Org/general.org"
                                           "~/Documents/Org/main.org"))
  (consult-notes-org-headings-mode)
  (when (locate-library "denote")
    (consult-notes-denote-mode)))
#+end_src

#+RESULTS:
: t

** The =init.el= section on consult-dir

#+begin_src emacs-lisp :tangle "init.el"
(use-package consult-dir
  :ensure t
  :bind (("C-x C-d" . consult-dir)
         :map minibuffer-local-completion-map
         ("C-x C-d" . consult-dir)
         ("C-x C-j" . consult-dir-jump-file))
  :config
  (setq consult-dir-default-command #'consult-find))
#+end_src

#+RESULTS:
: consult-dir-jump-file

** The =init.el= section with embark setup

This is copied from prot's setup! I need to check how the :bind setup works, it might load the libraries not how I expect (= checkout how use-package works

#+begin_src emacs-lisp :tangle "init.el"
;;; Extended minibuffer actions and more (embark.el)

(use-package embark
  :ensure t
  :bind
  ( :map minibuffer-local-map
    ("C-c C-c" . embark-collect)
    ("C-c C-e" . embark-export)))

;; Needed for correct exporting while using Embark with Consult
;; commands.
(use-package embark-consult
  :ensure t
  :after (embark consult))
#+end_src

#+RESULTS:


** The =init.el= section to save mini buffer history
Toggle saving of minibuffer history. This is build in. Vertico can use this to find recently opened files and put these results at the top. 
#+begin_src emacs-lisp :tangle "init.el"
(use-package savehist
  :ensure nil ; it is built-in
  :hook (after-init . savehist-mode))
#+end_src


** The =init.el= section to save recent files
The built-in `recentf-mode' keeps track of recently visited files. You can then access those through the `consult-buffer' interface or with `recentf-open'/`recentf-open-files'.

I do not use this facility, because the files I care about are either in projects or are bookmarked.

#+begin_src emacs-list :tangle "init.el"
(use-package savehist
  :ensure nil ; it is built-in
  :hook (after-init . recentf-mode))
#+end_src

** The =init.el= to relocate auto-save files

Normally auto-save files (which I find usefull) are saved in the same folder as the edited file. This then also shows up in consult-find, fd and grep, which is annoying. Now they are stored in a given folder.

I think this is causing issues! Need to check

#+begin_src emacs-lisp :tangle "init.el"

;; Redirect auto-saves
(setq auto-save-file-name-transforms
      `((".*" "~/.config/emacs/auto-saves/\\1" t)))

#+end_src

#+RESULTS:
| .* | ~/.config/emacs/auto-saves/\1 | t |

** The =init.el= section with corfu setup

Corfu enhances in-buffer completion with a small completion popup. The current candidates are shown in a popup below or above the point, and can be selected by moving up and down. Corfu is the minimalistic in-buffer completion counterpart of the Vertico minibuffer UI. 
Current setup is to press <TAB> to see completion.

This can also be used inside an org source block, but the source block needs to be opened in an elisp-mode buffer using ~C-c '~

#+begin_src emacs-lisp :tangle "init.el"
(use-package corfu
  :ensure t
  :hook (after-init . global-corfu-mode)
  :bind (:map corfu-map ("<tab>" . corfu-complete))
  :config
  (setq tab-always-indent 'complete)
  (setq corfu-preview-current nil)
  (setq corfu-min-width 20)

  (setq corfu-popupinfo-delay '(1.25 . 0.5))
  (corfu-popupinfo-mode 1) ; shows documentation after `corfu-popupinfo-delay'

  ;; Sort by input history (no need to modify `corfu-sort-function').
  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history)))
#+end_src


** The =init.el= setup of denote

Currently the directory is set as /Documents/notes, I can include all subdirectory by add 'expand-tree' or so before the dir. Check Prot's setup for that. 
#+begin_src emacs-lisp :tangle "init.el"
  (use-package denote
    :ensure t
    :hook
    ;; If you use Markdown or plain text files you want to fontify links
    ;; upon visiting the file (Org renders links as buttons right away).
    ((text-mode . denote-fontify-links-mode-maybe)
     ;; Highlight Denote file names in Dired buffers.  Below is the
     ;; generic approach, which is great if you rename files Denote-style
     ;; in lots of places as I do.
     ;;
     ;; If you only want the `denote-dired-mode' in select directories,
     ;; then modify the variable `denote-dired-directories' and use the
     ;; following instead:
     ;;
     ;;  (dired-mode . denote-dired-mode-in-directories)
     (dired-mode . denote-dired-mode))
    :bind
    ;; Denote DOES NOT define any key bindings.  This is for the user to
    ;; decide.  Here I only have a subset of what Denote offers.
    ( :map global-map
      ("C-c n n" . denote)
      ("C-c n N" . denote-type)
      ("C-c n d" . denote-sort-dired)
      ;; Note that `denote-rename-file' can work from any context, not
      ;; just Dired buffers.  That is why we bind it here to the
      ;; `global-map'.
      ;;
      ;; Also see `denote-rename-file-using-front-matter' further below.
      ("C-c n r" . denote-rename-file)
      ;; If you intend to use Denote with a variety of file types, it is
      ;; easier to bind the link-related commands to the `global-map', as
      ;; shown here.  Otherwise follow the same pattern for
      ;; `org-mode-map', `markdown-mode-map', and/or `text-mode-map'.
      :map org-mode-map
       ("C-c n i" . denote-link) ; "insert" mnemonic
       ("C-c n I" . denote-add-links)
       ("C-c n b" . denote-backliNks)
       ("C-c n R" . denote-rename-file-using-front-matter)
      ;; Key bindings specifically for Dired.
      :map dired-mode-map
      ("C-c C-d C-i" . denote-dired-link-marked-notes)
      ("C-c C-d C-r" . denote-dired-rename-marked-files)
      ("C-C C-d C-k" . denote-dired-rename-marked-files-with-keywords)
      ("C-c C-d C-f" . denote-dired-rename-marked-files-using-front-matter))
    :config
    ;; Remember to check the doc strings of those variables.
    (setq denote-directory "~/Documents/Notes" )

    ;; If you want to have a "controlled vocabulary" of keywords,
    ;; meaning that you only use a predefined set of them, then you want
    ;; `denote-infer-keywords' to be nil and `denote-known-keywords' to
    ;; have the keywords you need.
    (setq denote-known-keywords '("emacs" "idea" "note" "recipe" "bikes" "config"))
    (setq denote-infer-keywords t)
    (setq denote-sort-keywords t)
    (setq denote-buffer-name-prefix "[D] ") ; to identify all Denote buffers
    (setq denote-rename-buffer-format "%D")
    (denote-rename-buffer-mode 1))
#+end_src 


** The =init.el= section on denote-consult

This make Denote Buffers have their own section in consult-buffer. Consult-denote-find searches in note folder. Cannot also be setup to include denote silos (check manual). Also check out consult-note: [[https://github.com/mclear-tools/consult-notes][consult-note GitHub Page
]]
#+begin_src emacs-lisp :tangle "init.el"
(use-package consult-denote
  :ensure t
  :bind
  (("C-c n f" . consult-denote-find)
   ("C-c n g" . consult-denote-grep))
  :config
  (consult-denote-mode 1))
#+end_src

