config.org
** The =init.el= section on denote-org

#+begin_src emacs-lisp :tangle "init.el"
(use-package denote-org
  :ensure t
  :commands
  ;; I list the commands here so that you can discover them more
  ;; easily.  You might want to bind the most frequently used ones to
  ;; the `org-mode-map'.
  ( denote-org-link-to-heading
    denote-org-backlinks-for-heading

    denote-org-extract-org-subtree

    denote-org-convert-links-to-file-type
    denote-org-convert-links-to-denote-type

    denote-org-dblock-insert-files
    denote-org-dblock-insert-links
    denote-org-dblock-insert-backlinks
    denote-org-dblock-insert-missing-links
    denote-org-dblock-insert-files-as-headings))
#+end_src

#+RESULTS:

** The =init.el= section on denote-silo

#+begin_src emacs-lisp :tangle "init.el"
(use-package denote-silo
  :ensure t
  ;; Bind these commands to key bindings of your choice.
  :commands ( denote-silo-create-note
              denote-silo-open-or-create
              denote-silo-select-silo-then-command
              denote-silo-dired
              denote-silo-cd )
  :config
  ;; Add your silos to this list.  By default, it only includes the
  ;; value of the variable `denote-directory'.
  (setq denote-silo-directories
        (list denote-directory
              "~/Documents/Notes/"
              "~/Documents/Huiswiki/"
              "~/Documents/Recipebook/"
              "~/Documents/Bikes/"
              "~/Documents/Systemwiki/")))
#+end_src

#+RESULTS:
: t

** The =init.el= section on denote-journal

#+begin_src emacs-lisp :tangle "init.el"
(use-package denote-journal
  :ensure t
  ;; Bind those to some key for your convenience.
  :commands ( denote-journal-new-entry
              denote-journal-new-or-existing-entry
              denote-journal-link-or-create-entry )
  :hook (calendar-mode . denote-journal-calendar-mode)
  :config
  ;; Use the "journal" subdirectory of the `denote-directory'.  Set this
  ;; to nil to use the `denote-directory' instead.
  (setq denote-journal-directory
        (expand-file-name "Journal" denote-directory))
  ;; Default keyword for new journal entries. It can also be a list of
  ;; strings.
  (setq denote-journal-keyword "journal")
  ;; Read the doc string of `denote-journal-title-format'.
  (setq denote-journal-title-format 'day-date-month-year))

#+end_src

#+RESULTS:
| denote-journal-calendar-mode | org--setup-calendar-bindings |

** The =init.el= setup of org-mode

*** The =init.el= main setup of org

Some explanations:
- org-ellipsis: icon when folding a heading
- org-log-done: log timestamp when going from TODO to DONE
- org-hide-emphasis-markers: ?
- org-todo-keywords: Set keywords, multiple TODO sequences can be set but I have not done so yet.

Org refiling is set like this, so I see the full path of the outline. To deal with different headers level and repeating subheadings (e.g. Tasks and Ideas)
#+begin_src 
 (setq org-refile-targets '(("agenda.org" :maxlevel . 1)
      ("personal.org" :maxlevel . 1)
      ("readinglist.org" :maxlevel . 1)
      ("projects.org" :maxlevel . 2)))
 (setq org-refile-use-outline-path 'file)
 (setq org-outline-path-complete-in-steps nil)
#+end_src


#+begin_src emacs-lisp :tangle "init.el"
      ;;; Org-mode (personal information manager)
  (use-package org
    :ensure nil
    :init
    (setq org-directory (expand-file-name "~/Documents/Org/"))
    (setq org-agenda-files (list "agenda.org" "inbox.org" "projects.org" "personal.org" "readinglist.org")) 
    (setq org-agenda-skip-scheduled-if-done t)
    (setq org-imenu-depth 7)

    (add-to-list 'safe-local-variable-values '(org-hide-leading-stars . t))
    (add-to-list 'safe-local-variable-values '(org-hide-macro-markers . t))
    :bind
    ( :map global-map
      ("C-c l" . org-store-link)
      ("C-c a" . org-agenda)
      ("C-c o" . org-open-at-point-global)
      :map org-mode-map
      ;; I don't like that Org binds one zillion keys, so if I want one
      ;; for something more important, I disable it from here.
      ("C-c M-l" . org-insert-last-stored-link)
      ("C-c C-M-l" . org-toggle-link-display)
      ("M-." . org-edit-special) ; alias for C-c ' (mnenomic is global M-. that goes to source)
      :map org-src-mode-map
      ("M-," . org-edit-src-exit) ; see M-. above
      :map narrow-map
      ("b" . org-narrow-to-block)
      ("e" . org-narrow-to-element)
      ("s" . org-narrow-to-subtree))

    ;;;; general settings
    :config
    (setq org-refile-targets '(("agenda.org" :maxlevel . 1)
      ("personal.org" :maxlevel . 1)
      ("readinglist.org" :maxlevel . 1)
      ("projects.org" :maxlevel . 2)))
    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)
    (setq org-hide-emphasis-markers t)
    (setq org-hide-leading-stars nil)
    (setq org-ellipsis "")
    (setq org-cycle-separator-lines 1) ;;number of seperator lines between collapsed headings
    (setq org-structure-template-alist
  	'(("s" . "src")
  	  ("e" . "src emacs-lisp")
  	  ("E" . "src emacs-lisp :results value code :lexical t")
  	  ("t" . "src emacs-lisp :tangle FILENAME")
  	  ("b" . "src bash")
  	  ("x" . "export")
  	  ("q" . "quote")))
    (setq org-fold-catch-invisible-edits 'show) ;; what happens when you edit in a folded block
    (setq org-loop-over-headlines-in-active-region 'start-level)
    (setq org-modules '(ol-info ol-eww))
    (setq org-insert-heading-respect-content t)
    (setq org-highlight-latex-and-related nil) ; other options affect elisp regexp in src blocks
    (setq org-fontify-quote-and-verse-blocks t)
    (setq org-fontify-whole-block-delimiter-line t)
    (setq org-priority-faces nil)
    (setq org-log-done 'time)
    (setq org-table-convert-region-max-lines 20000)
    (setq org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
  	'((sequence
  	   "TODO(t)"           ; A task that is ready to be tackled
  	   "NEXT(n)"           ; An idea, not urgent
  	   "HOLD(h)"            ; To read, not urgent
  	   "|"                 ; needed for separation
  	   "DONE(d)"           ; Task has been completed
  	   "ARCHIVED(a)" )))

    (setq org-agenda-custom-commands
      '(("g" "Get Things Done (GTD)"
         ((agenda ""
                  ((org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'deadline))
                   (org-deadline-warning-days 0)))

          (todo "NEXT"
                ((org-agenda-skip-function
                  '(org-agenda-skip-entry-if 'deadline))
                 (org-agenda-prefix-format "  %i %-12:c [%e] ")
                 (org-agenda-overriding-header "\nTasks\n")))


          (tags-todo "planning"
                     ((org-agenda-prefix-format "  %?-12t% s")
                      (org-agenda-overriding-header "\nPlanning\n")))
          (agenda nil
                  ((org-agenda-entry-types '(:deadline))
                   (org-agenda-format-date "")
                   (org-deadline-warning-days 7)
                   (org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'notregexp "\\* NEXT"))
                   (org-agenda-overriding-header "\nDeadlines")))

          (tags-todo "inbox"
                     ((org-agenda-prefix-format "  %?-12t% s")
                      (org-agenda-overriding-header "\nInbox\n")))

          )))))

#+end_src

#+RESULTS:
: org-narrow-to-subtree
*** The =init.el= section with custom org functions

#+begin_src emacs-lisp :tangle "init.el"
(defun log-todo-next-creation-date (&rest ignore)
  "Log NEXT creation time in the property drawer under the key 'ACTIVATED'"
  (when (and (string= (org-get-todo-state) "NEXT")
             (not (org-entry-get nil "ACTIVATED")))
    (org-entry-put nil "ACTIVATED" (format-time-string "[%Y-%m-%d]"))))
(add-hook 'org-after-todo-state-change-hook #'log-todo-next-creation-date)

#+end_src
*** The =init.el= section on org-modern

Setting for org-modern. Its not turned on by default and I would like it to only style the headings. A hook is add to toggle org-hide-leading-stars on toggling org-modern.

#+begin_src emacs-lisp :tangle "init.el"
(use-package org-modern
  :ensure t
  :after org
  :config
  ;; Use custom symbols for heading stars
  (setq org-modern-star '("" "" "" "" "" ""))

  ;; Hide the original asterisks
  (setq org-modern-hide-stars nil)

  ;; Keep indentation reasonable
  (setq org-indent-indentation-per-level 2)

  ;; Disable other org-modern features
  (setq org-modern-table nil)
  (setq org-modern-list nil)
  (setq org-modern-block-name nil)
  (setq org-modern-checkbox nil)
  (setq org-modern-priority nil)
  (setq org-modern-tag nil)
  (setq org-modern-timestamp nil)
  (setq org-modern-keyword nil)
  (setq org-modern-todo nil)
  (setq org-modern-horizontal-rule nil))

(add-hook 'org-modern-mode-hook
          (lambda ()
            (setq org-hide-leading-stars org-modern-mode)))
#+end_src

#+RESULTS:
| org-modern-mode-set-explicitly | #[nil ((setq org-hide-leading-stars org-modern-mode)) nil] |

