init.el

;;; Notmuch (mail indexer and mail user agent (MUA))

;; I installed notmuch from the distro's repos because the CLI program is
;; not dependent on Emacs.  Though the package also includes notmuch.el
;; which is what we use here (they are maintained by the same people).
(use-package notmuch
  :load-path "/usr/local/share/emacs/site-lisp/notmuch/"
  :defer t
  :commands (notmuch notmuch-mua-new-mail)
  :config
   (setq notmuch-saved-searches
      '((:name "inbox" :query "tag:inbox" :key [105] :sort-order newest-first :search-type nil)
       (:name "unread" :query "tag:unread" :key [117] :sort-order newest-first)
       (:name "flagged" :query "tag:flagged" :key [102] :sort-order newest-first)
       (:name "sent" :query "tag:sent" :key [116] :sort-order newest-first)
       (:name "drafts" :query "tag:draft" :key [100] :sort-order newest-first)
       (:name "Winkels" :query "folder:\"Folders/🏬 Winkels\"" :sort-order newest-first :count-query "tag:unread")
       (:name "Gmail" :query "folder:\"Folders/✉️ Gmail\"" :sort-order newest-first :count-query "tag:unread and folder:\"Folders/✉️ Gmail\"")
       (:name "Tijdelijk" :query "folder:\"Folders/⏱️ Tijdelijk\"" :sort-order newest-first :count-query "tag:unread")
       (:name "🧔🏻‍♂️ Persoonlijk" :query "folder:\"Folders/🧔🏻‍♂️ Persoonlijk\"" :sort-order newest-first :count-query "tag:unread")
       (:name "🗞️ Newsletters" :query "folder:\"Folders/🗞️ Newsletters\"" :sort-order newest-first :count-query "tag:unread")
       (:name "❤️‍🩹 Zorg" :query "folder:\"Folders/❤️‍🩹 Zorg\"" :sort-order newest-first :count-query "tag:unread")
       (:name "🏡 Huishouden" :query "folder:\"Folders/🏡 Huishouden\"" :sort-order newest-first :count-query "tag:unread")
       (:name "📰 Accounts" :query "folder:\"Folders/📰 Accounts\"" :sort-order newest-first :count-query "tag:unread"))))

(use-package ol-notmuch
  :ensure t
  :after notmuch)

(defun my-notmuch-bookmark-jump (bookmark)
  "Jump to a notmuch saved search bookmark."
  (let ((search (bookmark-prop-get bookmark 'notmuch-search)))
    (notmuch-search search)))

(defun my-notmuch-bookmark-set ()
  "Set a bookmark for the current notmuch search buffer."
  (interactive)
  (unless (derived-mode-p 'notmuch-search-mode)
    (user-error "Not in a notmuch search buffer"))
  (let* ((name (read-string "Bookmark name: "))
         ;; Evaluate the variable, don't quote it
         (search notmuch-search-query-string)
         ;; Build the bookmark record
         (bookmark (list (cons 'notmuch-search search)
                         (cons 'handler #'my-notmuch-bookmark-jump))))
    ;; Store it properly
    (bookmark-store name bookmark nil)
    (message "Stored notmuch search bookmark: %s (%s)" name search)))

;;; Interactive and powerful git front-end (Magit)
(use-package transient
  :ensure t
  :config
  (setq transient-show-popup 0.5))

(use-package magit
  :ensure t
  :bind
  ( :map global-map
    ("C-c g" . magit-status))
  :init
  (setq magit-section-visibility-indicator '(magit-fringe-bitmap> . magit-fringe-bitmapv))
  :config
  (setq git-commit-summary-max-length 50)
  ;; NOTE 2023-01-24: I used to also include `overlong-summary-line'
  ;; in this list, but I realised I do not need it.  My summaries are
  ;; always in check.  When I exceed the limit, it is for a good
  ;; reason.
  (setq git-commit-style-convention-checks '(non-empty-second-line))

  (setq magit-diff-refine-hunk t)

  ;; Show icons for files in the Magit status and other buffers.
  (with-eval-after-load 'magit
    (setq magit-format-file-function #'magit-format-file-nerd-icons)))

(use-package biome
  :ensure t
  :bind
  :config
   (setq biome-query-coords
      '(("Eindhoven" 51.43531 5.526096)
        ("Groningen" 53.21962, 6.56706)
        ("Belo Horizonte" -19.91968, -43.94013)))
   (add-to-list 'biome-presets-alist
             '("biome-query-preset-101" :normal
               ((:name . "Weather Forecast") (:group . "daily")
                (:params
                 ("daily" "sunshine_duration" "precipitation_sum"
                  "temperature_2m_min" "temperature_2m_max")
                 ("past_days" . 2) ("forecast_days" . 6)
                 ("longitude" . 5.526096) ("latitude" . 51.43531)
                 ("timezone" . "CET")))))
   ;;Invoke with M-x biome-preset
)

(defvar center-document-desired-width 80
  "The desired width of a document centered in the window.")

(defun center-document--adjust-margins ()
  ;; Reset margins first before recalculating
  (set-window-parameter nil 'min-margins nil)
  (set-window-margins nil nil)

  ;; Adjust margins if the mode is on
(when center-document-mode
    (let ((margin-width (max 0
                             (truncate
                              (/ (- (window-width)
                                    center-document-desired-width)
                                 2.0)))))
      (when (> margin-width 0)
        (set-window-parameter nil 'min-margins '(0 . 0))
        (set-window-margins nil margin-width margin-width)))))

(define-minor-mode center-document-mode
  "Toggle centered text layout in the current buffer."
  :lighter " Centered"
  :group 'editing
  (if center-document-mode
      (add-hook 'window-configuration-change-hook #'center-document--adjust-margins 'append 'local)
    (remove-hook 'window-configuration-change-hook #'center-document--adjust-margins 'local))
  (center-document--adjust-margins))

(use-package show-font
  :ensure t
  :bind
  (("C-c s f" . show-font-select-preview)
   ("C-c s t" . show-font-tabulated)))
