config.org
** The (OLD) section on mode and header lines

#+begin_src emacs-lisp
(setq-default mode-line-format "")
(setq-default header-line-format
  '(:eval
    (let ((prefix (cond (buffer-read-only     '("RO" . nano-default-i))
                        ((buffer-modified-p)  '("**" . nano-critical-i))
                        (t                    '("RW" . nano-faded-i))))
          (mode (concat "(" (downcase (cond ((consp mode-name) (car mode-name))
                                            ((stringp mode-name) mode-name)
                                            (t "unknow")))
                        " mode)"))
          (coords (format-mode-line "%c:%l ")))
      (list
       (propertize " " 'face (cdr prefix)  'display '(raise -0.25))
       (propertize (car prefix) 'face (cdr prefix))
       (propertize " " 'face (cdr prefix) 'display '(raise +0.25))
       (propertize (format-mode-line " %b ") 'face 'nano-strong)
       (propertize mode 'face 'header-line)
       (propertize " " 'display `(space :align-to (- right ,(length coords))))
       (propertize coords 'face 'nano-faded)))))


#+end_src

#+RESULTS:
| :eval | (let ((prefix (cond (buffer-read-only '(RO . nano-face-tag-faded)) ((buffer-modified-p) '(** . nano-face-tag-popout)) (t '(RW . nano-face-tag-faded)))) (mode (concat ( (downcase (cond ((consp mode-name) (car mode-name)) ((stringp mode-name) mode-name) (t unknow)))  mode))) (coords (format-mode-line %c:%l ))) (list (propertize   'face (cdr prefix) 'display '(raise -0.25)) (propertize (car prefix) 'face (cdr prefix)) (propertize   'face (cdr prefix) 'display '(raise 0.25)) (propertize (format-mode-line  %b ) 'face 'nano-face-strong) (propertize mode 'face 'header-line) (propertize   'display `(space :align-to (- right ,(length coords)))) (propertize coords 'face 'nano-face-faded))) |

Now set specific modelines (elfeed and pdf view mode)
#+begin_src emacs-lisp


#+end_src


#+begin_src emacs-lisp
(add-hook 'pdf-view-mode-hook        #'nano-modeline-pdf-mode)
(add-hook 'elfeed-show-mode-hook     #'nano-modeline-elfeed-entry-mode)
(add-hook 'elfeed-search-mode-hook   #'nano-modeline-elfeed-search-mode)
#+end_src


** The (OLD) theme (NANO) setup

Nano-theme, copied from gitpage, note that some settings regarding the mode and headerline are set in here! I need to figure out how this is set uo

#+begin_src emacs-lisp
  (defface nano-default '((t)) "")   (defface nano-default-i '((t)) "")
  (defface nano-highlight '((t)) "") (defface nano-highlight-i '((t)) "")
  (defface nano-subtle '((t)) "")    (defface nano-subtle-i '((t)) "")
  (defface nano-faded '((t)) "")     (defface nano-faded-i '((t)) "")
  (defface nano-salient '((t)) "")   (defface nano-salient-i '((t)) "")
  (defface nano-popout '((t)) "")    (defface nano-popout-i '((t)) "")
  (defface nano-strong '((t)) "")    (defface nano-strong-i '((t)) "")
  (defface nano-critical '((t)) "")  (defface nano-critical-i '((t)) "")

  (defun nano-set-face (name &optional foreground background weight)
    "Set NAME and NAME-i faces with given FOREGROUND, BACKGROUND and WEIGHT"

    (apply #'set-face-attribute `(,name nil
                                  ,@(when foreground `(:foreground ,foreground))
                                  ,@(when background `(:background ,background))
                                  ,@(when weight `(:weight ,weight))))
    (apply #'set-face-attribute `(,(intern (concat (symbol-name name) "-i")) nil
                                  :foreground ,(face-background 'nano-default)
                                  ,@(when foreground `(:background ,foreground))
                                  :weight regular)))

  (defun nano-link-face (sources faces &optional attributes)
    "Make FACES to inherit from SOURCES faces and unspecify ATTRIBUTES."

    (let ((attributes (or attributes
                          '( :foreground :background :family :weight
                             :height :slant :overline :underline :box))))
      (dolist (face (seq-filter #'facep faces))
        (dolist (attribute attributes)
          (set-face-attribute face nil attribute 'unspecified))
        (set-face-attribute face nil :inherit sources))))

  (defun nano-install-theme ()
    "Install THEME"

    (set-face-attribute 'default nil
                        :foreground (face-foreground 'nano-default)
                        :background (face-background 'nano-default))
    (dolist (item '((nano-default .  (variable-pitch variable-pitch-text
                                      fixed-pitch fixed-pitch-serif))
                    (nano-highlight . (hl-line highlight))
                    (nano-subtle .    (match region
                                       lazy-highlight widget-field))
                    (nano-faded .     (shadow
                                       font-lock-comment-face
                                       font-lock-doc-face
                                       icomplete-section
                                       completions-annotations))
                    (nano-popout .    (warning
                                       font-lock-string-face))
                    (nano-salient .   (success link
                                       help-argument-name
                                       custom-visibility
                                       font-lock-type-face
                                       font-lock-keyword-face
                                       font-lock-builtin-face
                                       completions-common-part))
                    (nano-strong .    (font-lock-function-name-face
                                       font-lock-variable-name-face
                                       icomplete-first-match
                                       minibuffer-prompt))
                    (nano-critical .  (error
                                       completions-first-difference))
                    (nano-faded-i .   (help-key-binding))
                    (nano-default-i . (custom-button-mouse
                                       isearch))
                    (nano-critical-i . (isearch-fail))
                    ((nano-subtle nano-strong) . (custom-button
                                                  icomplete-selected-match))
                    ((nano-faded-i nano-strong) . (show-paren-match))))
      (nano-link-face (car item) (cdr item)))

    ;; Mode & header lines 
    (set-face-attribute 'header-line nil
                        :background 'unspecified
                        :underline nil
                        :box `( :line-width 1
                                :color ,(face-background 'nano-default))
                        :inherit 'nano-subtle)
    (set-face-attribute 'mode-line nil
                        :background (face-background 'default)
                        :underline (face-foreground 'nano-faded)
                        :height 40 :overline nil :box nil)
    (set-face-attribute 'mode-line-inactive nil
                        :background (face-background 'default)
                        :underline (face-foreground 'nano-faded)
                        :height 40 :overline nil :box nil))

  (defun nano-light (&rest args)
    "NANO light theme (based on material colors)"

    (interactive)
    (nano-set-face 'nano-default "#37474F" "#FFFFFF") ;; Blue Grey / L800
    (nano-set-face 'nano-strong "#000000" nil 'regular) ;; Black
    (nano-set-face 'nano-highlight nil "#FAFAFA") ;; Very Light Grey FAFAFA
    (nano-set-face 'nano-subtle nil "#ECEFF1") ;; Blue Grey / L50
    (nano-set-face 'nano-faded "#90A4AE") ;; Blue Grey / L300
    (nano-set-face 'nano-salient "#673AB7") ;; Deep Purple / L500
    (nano-set-face 'nano-popout "#FFAB91") ;; Deep Orange / L200
    (nano-set-face 'nano-critical "#FF6F00") ;; Amber / L900
    (nano-install-theme))
    
  (defun nano-dark (&rest args)
    "NANO dark theme (based on nord colors)"

    (interactive)
    (nano-set-face 'nano-default "#ECEFF4" "#2E3440") ;; Snow Storm 3 
    (nano-set-face 'nano-strong "#ECEFF4" nil 'regular) ;; Polar Night 0
    (nano-set-face 'nano-highlight nil "#3B4252")  ;; Polar Night 1
    (nano-set-face 'nano-subtle nil "#434C5E") ;; Polar Night 2 
    (nano-set-face 'nano-faded "#677691") ;; 
    (nano-set-face 'nano-salient "#81A1C1")  ;; Frost 2
    (nano-set-face 'nano-popout "#D08770") ;; Aurora 1
    (nano-set-face 'nano-critical "#EBCB8B") ;; Aurora 2
    (nano-install-theme))

#+end_src

#+RESULTS:
: nano-dark

*Move to nano-install*
Section to set the elfeed theme (only needed for pure nano theme)
#+begin_src emacs-lisp
(with-eval-after-load 'elfeed
  (custom-set-faces
  '(elfeed-search-title-face ((t (:inherit nano-default))))
  '(elfeed-search-unread-title-face ((t (:inherit nano-strong))))
  '(elfeed-search-date-face ((t (:inherit nano-default))))
  '(elfeed-search-feed-face ((t (:inherit nano-default))))
  '(elfeed-search-tag-face ((t (:inherit nano-salient))))))
#+end_src

Add command line theme switcher (in this way I can switch theme when loading emacs like emacs -dark):
#+begin_src emacs-lisp
(add-to-list 'command-switch-alist '("-dark"  . nano-dark))
(add-to-list 'command-switch-alist '("-light" . nano-light))
(if (member "-dark" command-line-args) (nano-dark) (nano-light))
#+end_src

#+RESULTS:
: nano-dark

** The (OLD) theme (MODUS) setup

I am using just the head and modeline setup of nano, and then using the modus theme faces. Its now a bit of a hacky solution by still defining the nano colours for use in the modeline setup.
#+begin_src emacs-lisp 
(use-package modus-themes
  :ensure t
  :config
  (load-theme 'modus-operandi-tinted :no-confirm-loading))


(nano-set-face 'nano-default "#37474F" "#FFFFFF") ;; Blue Grey / L800
(nano-set-face 'nano-strong "#000000" nil 'regular) ;; Black
(nano-set-face 'nano-highlight nil "#FAFAFA") ;; Very Light Grey FAFAFA
(nano-set-face 'nano-subtle nil "#ECEFF1") ;; Blue Grey / L50
(nano-set-face 'nano-faded "#90A4AE") ;; Blue Grey / L300
(nano-set-face 'nano-salient "#673AB7") ;; Deep Purple / L500
(nano-set-face 'nano-popout "#FFAB91") ;; Deep Orange / L200
(nano-set-face 'nano-critical "#FF6F00") ;; Amber / L900

(set-face-attribute 'header-line nil
                    :background 'unspecified
                    :underline nil
                    :box `( :line-width 1
                            :color ,(face-background 'nano-default))
                    :inherit 'nano-subtle)

(set-face-attribute 'mode-line nil
                    :background (face-background 'default)
                    :underline (face-foreground 'nano-faded)
                    :height 40 :overline nil :box nil)
(set-face-attribute 'mode-line-inactive nil
                    :background (face-background 'default)
                    :underline (face-foreground 'nano-faded)
                    :height 40 :overline nil :box nil)


#+end_src

#+RESULTS:


